In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
###Store CSV into DataFrame
#Data has been taken from Kaggle in csv files.

In [3]:
movies_file ="Resources/IMDb movies.csv"
books_file ="Resources/books.csv"

In [4]:
###Transform files to DataFrame
#Read csv files by pandas, create a proper DataFrame by renaming, dropping duplicate datas, choosing columns needed, and setting index.

In [5]:
movies_data_df = pd.read_csv(movies_file)
#movies_data_df.head()

/Users/aysinyavuz/opt/anaconda3/envs/PythonData38/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3165: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [6]:
#Checking columns names
movies_data_df.columns

Index(['imdb_title_id', 'title', 'original_title', 'year', 'date_published',
       'genre', 'duration', 'country', 'language', 'director', 'writer',
       'production_company', 'actors', 'description', 'avg_vote', 'votes',
       'budget', 'usa_gross_income', 'worlwide_gross_income', 'metascore',
       'reviews_from_users', 'reviews_from_critics'],
      dtype='object')

In [7]:
movies_df = movies_data_df[["imdb_title_id", "title"]].copy()
movies_df.head()

  imdb_title_id                        title
0     tt0000009                   Miss Jerry
1     tt0000574  The Story of the Kelly Gang
2     tt0001892               Den sorte drøm
3     tt0002101                    Cleopatra
4     tt0002130                    L'Inferno

In [8]:
movies_df.count()

imdb_title_id    85855
title            85855
dtype: int64

In [9]:
movies_df.drop_duplicates("title", inplace=True)
movies_df.count()

imdb_title_id    82094
title            82094
dtype: int64

In [10]:
# movies_df["movie_title"]=movies_df["movie_title"].fillna("unknown")
# unknown = movies_df.loc[movies_df["movie_title"]=="unknown"]
# unknown.count()

In [11]:
movies_df = movies_df.rename(columns= {"imdb_title_id":"id", "title":"movie_title"})
movies_df.set_index("id", inplace = True)
movies_df.head()

                           movie_title
id
tt0000009                   Miss Jerry
tt0000574  The Story of the Kelly Gang
tt0001892               Den sorte drøm
tt0002101                    Cleopatra
tt0002130                    L'Inferno

In [12]:
###Transform books_file to DataFrame
# Create a proper DataFrame by renaming, dropping duplicate datas, choosing columns needed, and setting index.

In [13]:
books_data_df = pd.read_csv(books_file)
#books_data_df.head()

In [14]:
books_data_df.columns

Index(['id', 'book_id', 'best_book_id', 'work_id', 'books_count', 'isbn',
       'isbn13', 'authors', 'original_publication_year', 'original_title',
       'title', 'language_code', 'average_rating', 'ratings_count',
       'work_ratings_count', 'work_text_reviews_count', 'ratings_1',
       'ratings_2', 'ratings_3', 'ratings_4', 'ratings_5', 'image_url',
       'small_image_url'],
      dtype='object')

In [15]:
books_df = books_data_df[["book_id", "authors", "title", "original_publication_year"]].copy()
books_df.head()

,book_id,authors,title,original_publication_year
0,2767052,Suzanne Collins,"The Hunger Games (The Hunger Games, #1)",2008.0
1,3,"J.K. Rowling, Mary GrandPré",Harry Potter and the Sorcerer's Stone (Harry P...,1997.0
2,41865,Stephenie Meyer,"Twilight (Twilight, #1)",2005.0
3,2657,Harper Lee,To Kill a Mockingbird,1960.0
4,4671,F. Scott Fitzgerald,The Great Gatsby,1925.0

In [16]:
# book_df.count()
books_df.drop_duplicates(["title"], inplace=True)
books_df.count()

book_id                      9964
authors                      9964
title                        9964
original_publication_year    9943
dtype: int64

In [17]:
books_df["original_publication_year"]=books_df["original_publication_year"].fillna(0)
books_df.count()

book_id                      9964
authors                      9964
title                        9964
original_publication_year    9964
dtype: int64

In [18]:
books_df = books_df.rename(columns= {"book_id":"ID", "authors":"Authors", "title":"Book_Title", "original_publication_year":"Published_Year"})
books_df.set_index("ID", inplace = True)
books_df.head()

,Authors,Book_Title,Published_Year
ID,,,
2767052,Suzanne Collins,"The Hunger Games (The Hunger Games, #1)",2008.0
3,"J.K. Rowling, Mary GrandPré",Harry Potter and the Sorcerer's Stone (Harry P...,1997.0
41865,Stephenie Meyer,"Twilight (Twilight, #1)",2005.0
2657,Harper Lee,To Kill a Mockingbird,1960.0
4671,F. Scott Fitzgerald,The Great Gatsby,1925.0

In [19]:
books_df["Published_Year"]=books_df["Published_Year"].astype(int)
books_df.head()

,Authors,Book_Title,Published_Year
ID,,,
2767052,Suzanne Collins,"The Hunger Games (The Hunger Games, #1)",2008
3,"J.K. Rowling, Mary GrandPré",Harry Potter and the Sorcerer's Stone (Harry P...,1997
41865,Stephenie Meyer,"Twilight (Twilight, #1)",2005
2657,Harper Lee,To Kill a Mockingbird,1960
4671,F. Scott Fitzgerald,The Great Gatsby,1925

In [20]:
###Create database connection
#Create engine to connect sql

In [21]:
connection_string = "postgres:bootcamp@localhost:5432/Netflix_IMDB"
engine=create_engine(f"postgresql://{connection_string}")

In [22]:
engine.table_names()

<ipython-input-22-d72bc75a6b62>:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['imdb_movies', 'IMDB_movies', 'books']

In [23]:
###Load DataFrames into database
#Through engine connection, load the dataframe into database

In [24]:
movies_df.to_sql(name="IMDB_movies", con=engine, if_exists="replace", index=True)
books_df.to_sql(name="books", con=engine, if_exists= "replace", index=True)